app/Controllers/ClientController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
public function auth()
{

    $model = new ClientModel();


    $telephone = $this->request
                  ->getPost('telephone');


    $client = $model
              ->where(
                  'numero_telephone',
                  $telephone
            )
            ->first();



    if(!$client)
    {

        // création automatique
        $id = $model->insert([
            'numero_telephone'=>$telephone,
            'solde'=>0
        ]);


        $client = $model->find($id);