app/Controllers/ClientController.php

SELECT *
FROM `clients`
WHERE `numero_telephone` = '0349518383'
 LIMIT 1
INSERT INTO `clients` (`numero_telephone`, `solde`) VALUES ('0349518383', 0)
---
public function auth()
{

    $model = new ClientModel();


    $telephone = trim((string) $this->request->getPost('telephone'));
    if ($telephone === '') {
        return redirect()->back()->withInput()->with('error', 'Numéro de téléphone requis.');
    }

    $client = $model
              ->where(
                  'numero_telephone',
                  $telephone
            )
            ->first();



    if(!$client)
    {

        // création automatique
        $id = $model->insert([
            'numero_telephone' => $telephone,
            'solde' => 0,
        ], true);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 5
---
public function dashbord()
{

    $id=session()->get('client_id');


    $model=new ClientModel();


    $data['client']=$model->find($id);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
     public function retraitForm()
    {
        $model = new ClientModel();
        $data['client'] = $model->find(session()->get('client_id'));

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
     public function transfertForm()
    {
        $model = new ClientModel();
        $data['client'] = $model->find(session()->get('client_id'));

SELECT *
FROM `clients`
WHERE `numero_telephone` = '0349518383'
---
     public function transfert()
    {
        $clientId       = session()->get('client_id');
        $telDestinataire = $this->request->getPost('telephone_destinataire');
        $montant        = (float) $this->request->getPost('montant');

        if ($montant <= 0) {
            return redirect()->to('client/transfert')->with('error', 'Montant invalide.');
        }

        $db = db_connect();

        $destinataire = $db->table('clients')->where('numero_telephone', $telDestinataire)->get()->getRow();

SELECT *
FROM `clients`
WHERE `id` = 1
---
            ? (float) $bareme['frais_fixe'] + $montant * ((float) $bareme['frais_pourcentage'] / 100)
            : 0;

        $client = $db->table('clients')->where('id', $clientId)->get()->getRow();

UPDATE `clients` SET `solde` = 300
WHERE `id` = 1
UPDATE `clients` SET `solde` = 200
WHERE `id` = 2
INSERT INTO `operations` (`reference`, `type_operation_id`, `client_id`, `client_destinataire_id`, `montant`, `frais`, `solde_avant`, `solde_apres`, `statut`) VALUES ('TRF-6a5dfdd69ac5c', 3, 1, 2, 200, 0, 500, 300, 'REUSSI')
---
        $soldeApresClient = $client->solde - $total;
        $soldeApresDest   = $destinataire->solde + $montant;

        $db->table('clients')->where('id', $clientId)->update(['solde' => $soldeApresClient]);
        $db->table('clients')->where('id', $destinataire->id)->update(['solde' => $soldeApresDest]);

        $db->table('operations')->insert([
            'reference'              => uniqid('TRF-'),
            'type_operation_id'      => $type['id'],
            'client_id'              => $clientId,
            'client_destinataire_id' => $destinataire->id,
            'montant'                => $montant,
            'frais'                  => $frais,
            'solde_avant'            => $client->solde,
            'solde_apres'            => $soldeApresClient,
            'statut'                 => 'REUSSI',
        ]);

SELECT *
FROM `operations`
WHERE `client_id` = 1
ORDER BY `date_operation` DESC
---
    public function historique()
    {
        $clientId = session()->get('client_id');

        $db = db_connect();

        $data['operations'] = $db->table('operations')
            ->where('client_id', $clientId)
            ->orderBy('date_operation', 'DESC')
            ->get()
            ->getResult();