app/Models/BeneficeModel.php

    public function situationGains()
    {
        return $this->select('types_operation.libelle as type_operation, SUM(benefices.montant) as total_frais')
                     ->join('types_operation', 'types_operation.id = benefices.type_operation_id')
                     ->groupBy('types_operation.libelle')
                     ->findAll();
---
SELECT `types_operation`.`libelle` as `type_operation`, SUM(benefices.montant) as total_frais
FROM `benefices`
JOIN `types_operation` ON `types_operation`.`id` = `benefices`.`type_operation_id`
GROUP BY `types_operation`.`libelle`