app/Models/ClientModel.php

SELECT *
FROM `clients`
ORDER BY `solde` DESC
---
    public function situationComptes()
    {
        return $this->orderBy('solde', 'DESC')->findAll();